/*-----------------------------------------------------------------------------------------
**
** 版权(Copyright): Inory, 2022~
**
** 文件名(FileName): dfsStatus.c
**
** 描述(Description): 本文件定义dfsStatus类成员函数实现
**
** 包含的函数(Included Function):
**
** 设计注记(Design Annotation):
**
** 作者(Author):
**      Inory, 2022年6月5日开始编写本文件
**
** 更改历史(Modification History):
**      Inory, 2022年6月5日 创建本文件
**      $Revision$
**      $Date$
**      $Author$
**      $Log$
**
**-----------------------------------------------------------------------------------------
*/
/*-----------------------------------------------------------------------------------------
**                                         Include
**-----------------------------------------------------------------------------------------
*/
#include "dfsStatus.h"

/*-----------------------------------------------------------------------------------------
**                                   Function Declaration
**-----------------------------------------------------------------------------------------
*/
/* 设置状态值 */
static Status* setStatusValue(void* thiz, int value);
/* 获取状态值 */
static int getStatusValue(void* thiz);
