/*-----------------------------------------------------------------------------------------
**
** 版权(Copyright): Inory, 2022~
**
** 文件名(FileName): cCVariable.h
**
** 描述(Description): 本文件定义条件变量(condition_variable)在C语言编译环境下的封装接口
**
** 设计注记(Design Annotation):
**
** 作者(Author):
**      Inory, 2022年5月22日开始编写本文件
**
** 更改历史(Modification History):
**      Inory, 2022年5月22日 创建本文件
**      $Revision$
**      $Date$
**      $Author$
**      $Log$
**
**-----------------------------------------------------------------------------------------
*/
#ifndef _C_CONDITION_VARIABLE_H
#define _C_CONDITION_VARIABLE_H

/*-----------------------------------------------------------------------------------------
**                                         Include
**-----------------------------------------------------------------------------------------
*/
#include "cMutex.h"

/*-----------------------------------------------------------------------------------------
**                                     Class Definition
**-----------------------------------------------------------------------------------------
*/
/* <类描述> */
/* 1)条件变量接口 */
/* 2) */
typedef struct SCCVariable
{
	/* 将线程上锁,等待条件触发 */
	void (*wait)(void* thiz, CMutex* mutex);
	/* 条件触发,唤醒对应互斥量 */
	void (*notify_one)(void* thiz);

#ifdef _WIN32
	/* 条件变量句柄 */
	HANDLE _cv;
#endif
	/* 条件变量状态,加性信号量 */
	int _cvStatus;
} CCVariable;

/*-----------------------------------------------------------------------------------------
**                                   Function Declaration
**-----------------------------------------------------------------------------------------
*/
/* 构造函数 */
extern CCVariable* CreateCCVariable(void);

#endif /* _C_CONDITION_VARIABLE_H */
