/*-----------------------------------------------------------------------------------------
**
** 版权(Copyright): Inory, 2022~
**
** 文件名(FileName): cMap.h
**
** 描述(Description): 本文件定义映射表(map)在C语言编译环境下的封装接口
**
** 设计注记(Design Annotation):
**
** 作者(Author):
**      Inory, 2022年5月24日开始编写本文件
**
** 更改历史(Modification History):
**      Inory, 2022年5月24日 创建本文件
**      $Revision$
**      $Date$
**      $Author$
**      $Log$
**
**-----------------------------------------------------------------------------------------
*/
#ifndef _C_MAP_H
#define _C_MAP_H

/*-----------------------------------------------------------------------------------------
**                                         Include
**-----------------------------------------------------------------------------------------
*/
#include "cTree.h"

/*-----------------------------------------------------------------------------------------
**                                     Type Declaration
**-----------------------------------------------------------------------------------------
*/
/* 映射表结构体声明 */
typedef struct CMap CMap;

/*-----------------------------------------------------------------------------------------
**                                     Class Definition
**-----------------------------------------------------------------------------------------
*/
/* <类描述> */
/* 1)映射表接口 */
/* 2) */
struct CMap
{
	/* 映射表 */
	void* _map;
	/* 键值占用内存大小 */
	int _keySize;
	/* 数值占用内存大小 */
	int _valueSize;

	/* 统计键值个数 */
	int (*count)(CMap* thiz, const void* key);
	/* 根据键值查找节点 */
	CIterator (*find)(CMap* thiz, const void* key);
	/* 根据键值删除节点 */
	void (*erase)(CMap* thiz, const void* key);
	/* 插入键值对 */
	CIterBoolPair (*insert)(CMap* thiz, const void* key, const void* val);
	/* 返回映射表首节点 */
	CIterator (*begin)(CMap* thiz);
	/* 返回映射表尾节点 */
	CIterator(*end)(CMap* thiz);
	/* 清空映射表 */
	void (*clear)(CMap* thiz);
};

/*-----------------------------------------------------------------------------------------
**                                   Function Declaration
**-----------------------------------------------------------------------------------------
*/
/* 构造函数 */
extern CMap* CreateCMap(int keySize, int valueSize, comparer keyCmp);

#endif /* _C_MAP_H */
