/*-----------------------------------------------------------------------------------------
**
** 版权(Copyright): Inory, 2022~
**
** 文件名(FileName): cMutex.h
**
** 描述(Description): 本文件定义互斥量(mutex)在C语言编译环境下的封装接口
**
** 设计注记(Design Annotation):
**
** 作者(Author):
**      Inory, 2022年5月22日开始编写本文件
**
** 更改历史(Modification History):
**      Inory, 2022年5月22日 创建本文件
**      $Revision$
**      $Date$
**      $Author$
**      $Log$
**
**-----------------------------------------------------------------------------------------
*/
#ifndef _C_MUTEX_H
#define _C_MUTEX_H

/*-----------------------------------------------------------------------------------------
**                                         Include
**-----------------------------------------------------------------------------------------
*/
#include <windows.h>
#include <malloc.h>
#include <stdio.h>

/*-----------------------------------------------------------------------------------------
**                                     Class Definition
**-----------------------------------------------------------------------------------------
*/
/* <类描述> */
/* 1)互斥量接口 */
/* 2) */
typedef struct SCMutex
{
	/* 互斥量上锁 */
	void (*lock)(void* thiz);
	/* 互斥量解锁 */
	void (*unlock)(void* thiz);

#ifdef _WIN32
	/* 互斥量句柄 */
	HANDLE _mutex;
#endif
	/* 锁状态计数 */
	int _lockStatus;
} CMutex;

/*-----------------------------------------------------------------------------------------
**                                   Function Declaration
**-----------------------------------------------------------------------------------------
*/
/* 构造函数 */
extern CMutex* CreateCMutex(void);

#endif /* _C_MUTEX_H */
