/*-----------------------------------------------------------------------------------------
**
** 版权(Copyright): Inory, 2022~
**
** 文件名(FileName): cPair.h
**
** 描述(Description): 本文件定义键值对(pair)在C语言编译环境下的封装接口
**
** 设计注记(Design Annotation):
**
** 作者(Author):
**      Inory, 2022年5月22日开始编写本文件
**
** 更改历史(Modification History):
**      Inory, 2022年5月22日 创建本文件
**      $Revision$
**      $Date$
**      $Author$
**      $Log$
**
**-----------------------------------------------------------------------------------------
*/
#ifndef _C_PAIR_H
#define _C_PAIR_H

/*-----------------------------------------------------------------------------------------
**                                         Include
**-----------------------------------------------------------------------------------------
*/
#include "cIterator.h"

/*-----------------------------------------------------------------------------------------
**                                     Type Declaration
**-----------------------------------------------------------------------------------------
*/
/* 键值对结构体声明 */
typedef struct CPair CPair;
/* 迭代器-bool型键值对结构体声明 */
typedef struct CIterBoolPair CIterBoolPair;

/*-----------------------------------------------------------------------------------------
**                                     Class Definition
**-----------------------------------------------------------------------------------------
*/
/* <类描述> */
/* 1)键值对接口 */
/* 2) */
struct CPair
{
	/* 键值 */
	void* _first;
	/* 值 */
	void* _second;
};

/* <类描述> */
/* 1)迭代器-bool型键值对接口 */
/* 2) */
struct CIterBoolPair
{
	/* 迭代器 */
	CIterator _first;
	/* 布尔值 */
	int _second;
};

/*-----------------------------------------------------------------------------------------
**                                   Function Declaration
**-----------------------------------------------------------------------------------------
*/
/* 形成迭代器-bool型键值对 */
extern CIterBoolPair cMakeIterBoolPair(CIterator x, int y);

#endif /* _C_PAIR_H */
