/*-----------------------------------------------------------------------------------------
**
** 版权(Copyright): Inory, 2022~
**
** 文件名(FileName): cQueue.h
**
** 描述(Description): 本文件定义队列(queue)在C语言编译环境下的封装接口
**
** 设计注记(Design Annotation):
**
** 作者(Author):
**      Inory, 2022年5月23日开始编写本文件
**
** 更改历史(Modification History):
**      Inory, 2022年5月23日 创建本文件
**      $Revision$
**      $Date$
**      $Author$
**      $Log$
**
**-----------------------------------------------------------------------------------------
*/
#ifndef _C_QUEUE_H
#define _C_QUEUE_H

/*-----------------------------------------------------------------------------------------
**                                         Include
**-----------------------------------------------------------------------------------------
*/
#include "cList.h"

/*-----------------------------------------------------------------------------------------
**                                     Type Declaration
**-----------------------------------------------------------------------------------------
*/
/* 列表结构体声明 */
typedef struct CQueue CQueue;

/*-----------------------------------------------------------------------------------------
**                                     Class Definition
**-----------------------------------------------------------------------------------------
*/
/* <类描述> */
/* 1)队列接口 */
/* 2) */
struct CQueue
{
	/* 队列 */
	void* _queue;
	/* 节点中数据占用内存大小 */
	int _nodeSize;

	/* 返回队列头节点 */
	void* (*front)(CQueue* thiz);
	/* 判断队列是否为空 */
	int (*empty)(CQueue* thiz);
	/* 队列插入节点 */
	void (*push)(CQueue* thiz, const void* val);
	/* 队列弹出节点 */
	void (*pop)(CQueue* thiz);
};

/*-----------------------------------------------------------------------------------------
**                                   Function Declaration
**-----------------------------------------------------------------------------------------
*/
/* 队列构造函数 */
extern CQueue* CreateCQueue(int nodeSize, comparer keyCmp);

#endif /* _C_QUEUE_H */
